<template>
  <div>
    <div class="paragraph">
      <h1>李梅樹紀念館隱私權保護政策</h1>
      <p>李梅樹紀念館（我們）在提供線上服務平台時，非常重視您的隱私權。我們致力做到公開而透明。此李梅樹紀念館隱私權保護政策大致在說明我們如何獲取您的個人資訊，以及我們在獲取後如何使用這些資訊。</p>
      <h2>我們如何定義「個人資訊」？</h2>
      <p>我們對「個人資訊」的定義是，能夠確定個人身份的資訊，如姓名或電子郵件地址；所有定義範圍外的資訊均為「非個人資訊」。如果我們將您的個人資訊與非個人資訊儲存在一起，我們會將該組合視為個人資訊。如果我們從某組資料中移除所有個人資訊，剩餘資料即為非個人資訊。</p>
      <h2>我們如何得知您的個人資訊？</h2>
      <p>我們會透過以下途徑得知您的個人資訊：</p>
      <ul>
        <li>您直接提供給我們（如：主動與我們聯絡並留下聯絡資訊）</li>
        <li>我們透過我們的產品與服務自動收集您的個人資訊（如：填寫報名表、瀏覽網站時將收集 Cookie 資料）</li>
        <li>他人向我們提供您的個人資訊（如：他人幫您填寫報名表、簽到表）</li>
        <li>我們嘗試根據您向我們提供的資訊，瞭解更多您的個人資訊（如：我們使用您的瀏覽器資訊決定我們的服務語言）</li>
      </ul>
      <h2>我們獲取後如何使用您的資訊？</h2>
      <p>在您提供資訊後，我們會將資訊用在您許可的用途上。我們通常會將您的資訊用來提供及改善我們的產品與服務，讓我們可以提供更好的服務。</p>
      <h2>我們在什麼時候與他人分享您的資訊？</h2>
      <ul>
        <li>我們要求並得到您的授權時。</li>
        <li>當我們為了保持資料開放原則時，有時會披露一些資訊，以改善產品及創造開放式網路。當我們這麼做時，我們會移除您的個人資訊，並試圖盡量減少披露資訊使您的身份被識別的風險。</li>
        <li>法律要求我們這麼做時。只要是政府提出或是我們收到與訴訟有關的要求，我們均會遵照法律要求行事。當我們被要求以這種方式提供您的個人資訊時，我們會通知您；除非法律禁止這麼做。當我們收到此種要求時，我們會只透漏您的個人資訊（如果我們有足夠的理由相信法律要求我們這麼做）。本策政所有內容均不會限制您可能針對協力廠商的披露資訊要求所提出的任何合法辯護或反對權利。</li>
        <li>我們認為有必要保護您或他人不受傷害時。只有在我們有足夠的理由相信必須合理地保護您、我們的其他用戶、本館 或公眾的權利、財產或安全，我們才會以此方式分享您的資訊。</li>
        <li>如果我們的組織架構或狀況出現變化（如果我們進行重組、被收購或破產），我們可能會將您的資訊轉移給繼承人或附屬機構。</li>
      </ul>
      <h2>我們如何儲存及保護您的個人資訊？</h2>
      <p>在獲取您的個人資訊後，我們會盡力加以保護。我們會在物理上、業務上及技術安全等方面採取措施保護您的個人資訊。除了自身所做的努力之外，如果我們得知有安全性漏洞，也會通知您，以讓您能夠採取適當的防護措施。</p>
      <p>我們只會為了達到收集目而在一段期間內保留您的個人資訊，除此以外，我們不會為了其他目的保留更長時間。當我們不需要這些資訊時，我們會採取措施予以銷毀，除非法律要求我們繼續保留這些資訊。</p>
      <h2>您還應該瞭解些什麼？</h2>
      <p>我們使用了許多套件來提供更好的功能與使用者體驗，如果您使用了相關的資訊代表您同意相關條件的使用者條款，相關元件如下：</p>
      <ul>
        <li>我們使用Google Map 來提供交通相關資訊，使用我們提供之交通資訊服務代表您同意 Google Map 條款。</li>
      </ul>
      <p>如果您的年齡不足 6 歲，我們不會獲取您的個人資訊；如果您的年齡在 6 ~ 13 歲間，我們獲取您的個人資訊時將會獲得您的監護人的同意。如果您是家長，且認為您的年齡不足 13 歲的子女已向我們提供其個人資訊，並不希望您子女的資料留存在李梅樹紀念館，請與我們聯絡，以便我們移除您子女的個人資訊。</p>
      <p>我們可能會需要變更此政策及我們的隱私權公告。我們會在線上發佈相關更新。如果有任何重大變更，我們會透過李梅樹紀念館官方網站與官方粉絲專頁用來發佈此類公告來宣佈更新消息。在此類變更生效日後，如果您繼續使用我們的產品與服務，則表示您接受這些變更。為更方便您檢視，我們會在網頁上方公佈此類變更的生效日期。</p>
      <h2 id="cookie">Cookie</h2>
      <p>為了提供您最佳的服務，本網站會在您的電腦中放置並取用我們的Cookie，若您不願接受Cookie的寫入，您可在您使用的瀏覽器功能項中設定隱私權等級為高，即可拒絕Cookie的寫入，但可能會導至網站某些功能無法正常執行。</p>
    </div>
  </div>
</template>

<script>
  import { mapGetters } from 'vuex'
  export default {
    computed: {
      ...mapGetters(['language'])
    }
  }
</script>