<template>
  <div>
    <div class="paragraph">
      <h1>{{ $route.meta.label[language] }}</h1>
      <p>
        <img src="https://api.limeishu.org.tw/images/lms-20181127-94371919.jpg" alt="">
      </p>
      <p>
        李梅樹紀念館在地耕耘即將邁入第三十個年頭，這些年來本館除了持續李梅樹教授畫作與文物的保存、修護與展覽，推廣在地藝文活動，並同時大量典藏三峽地方文物，包含老照片、影片與文書，是地方學文物的根基；更致力於推動館舍提升，進一步朝向數位化、資料開放的方向邁進，期許透過網路的傳播能讓地方文化、藝術與人文繼續的保存並傳承下去。
      </p>
      <p>
        然而，館舍的經營需要大量的人力物力，期許各界人士倘若同樣認同本館理念，同樣想為台灣文化典藏、保存、推廣並進一步數位化與開放盡一份自己的心力，歡迎捐助李梅樹文教基金會，期待透過您的捐助，讓我們一起邁向下一個三十年。
      </p>
      <h2>捐款資訊</h2>
      <ul>
        <li>銀行：118 板信商業銀行文化分行</li>
        <li>戶名：財團法人李梅樹文教基金會</li>
        <li>帳號：0093 201 3508833</li>
      </ul>
      <p>
        如有大額捐款或是收據開立需求，請聯絡我們：<a href="tel:+886226732333">(02) 2673-2333</a>
      </p>
      <h2>資金用途</h2>
      <p>您的捐款將會用於</p>
      <h3>梅樹月</h3>
      <p>自2012年起，每年三至四月之間，由李梅樹紀念館主辦「梅樹月」藝術文化活動，傳承與發揚李梅樹熱愛鄉土的精神，以藝術的平民化、生活化為理念，在地人文歷史的關注為本，結合跨領域的當代藝術家，希望讓藝術跨越美術館的藩籬，傳遞給人們更多的感動。</p>
      <p><a href="https://msm.limeishu.org.tw" target="_blank">梅樹月網站連結</a></p>
      <h3>畫作與文物的典藏、修護與展覽</h3>
      <p>李梅樹紀念館位於新北市三峽區，典藏有李梅樹作品、手稿等千餘件，相關文物上萬件，並致力於妥善保存、數位化，並透過展覽與數位開放，期許能推廣、傳承台灣的美術價值與地方文化。</p>
    </div>
  </div>
</template>

<script>
  import { mapGetters } from 'vuex'
  export default {
    computed: {
      ...mapGetters(['language'])
    }
  }
</script>
