<template>
  <div id="home">
    <div class="spotlight left">
      <div class="image" :style="{ 'background-image': `url(${require('../assets/images/hend.jpg')})` }"></div>
      <div class="content">
        <h1>{{ intro.zh_TW.title }}</h1>
        <p>{{ intro.zh_TW.content }}</p>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data () {
    return {
      intro: {
        zh_TW: {
          title: '簡介',
          content: '本館初設於1990年，原名為「劉清港醫師李梅樹教授昆仲紀念館」；1995年4月遷入現址：台北市三峽區中華路43巷10號，並正式定名為「李梅樹紀念館」。紀念館設立之宗旨在紀念前輩畫家李梅樹先生。於三峽（三角湧）土生土長的李梅樹先生（1902-1983），生前致力於藝術創作，美術運動，一輩子堅持以東京美術學校習得的寫實路線，擁抱台灣鄉土之美，被稱為台灣美術運動中的「萬里長城」。1947年開始，李梅樹先生將畢生的精力投入三峽祖師廟的重建工程上，以創作藝術品的精神，完成結合民間藝術與學院藝術的「東方藝術殿堂」。此外，熱心公益的李梅樹先生，於1935至1958年間，陸續以三峽街庄協議員，縣議員等身分服務鄉里。日後並於藝專(現國立台灣藝術學院)、文化、師大等校任教。終其一生，李氏身兼藝術家，教育家，政治家與廟宇建築家，八十一年多采多姿的藝術生涯，在台灣美術史上寫下燦爛傳奇的一頁。本館除了展出李梅樹先生不同時期的畫作，另一方面，李梅樹生前的書信文件，畫具和畫稿等，也於館內的文物陳列室一一展出。期盼透過本館的展覽，不僅使參觀者得以體會藝術家創作生涯的心路歷程，更能進一步明瞭，李梅樹的一生正是台灣美術走向本土化的縮影。'
        }
      }
    }
  }
}
</script>

